---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.FabricAreaWrongLapSplice
source: html/c1ef1392-9da6-1550-5a95-ccee57a3ec5b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.FabricAreaWrongLapSplice Property

Fabric Area Sheet lap splice is incorrect. Can't create Fabric Area.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricAreaWrongLapSplice { get; }
```